pandas contain two type of ds:
1. Series():-series is a class in pandas.The object of series stores a 1d array with 1 column
2. DataFrame():-used for 2d array
Pandas is Data Analysis library which deal with csv(comma seperated values) file.

In [1]:
#import essential libraries
import numpy as np
import pandas as pd

In [2]:
#create a series usind pandas Series()
ser1=pd.Series([1,2,3,4,5])
print(ser1)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
ser2=pd.Series(np.arange(1,11).astype(np.int32))
print(ser2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [4]:
ser2=pd.Series(np.arange(1,11,2).astype(np.int32))
print(ser2)

0    1
1    3
2    5
3    7
4    9
dtype: int32

In [5]:
#wap to create a DataFrame
emp={"empid":[1001,1002,1003,1004],
     "empname":["Rohit","Mohit","Shobit","Mudit"],
     "Salary":[50000,60000,700000,80000]}
df=pd.DataFrame(emp)
print(df)

   empid empname  Salary
0   1001   Rohit   50000
1   1002   Mohit   60000
2   1003  Shobit  700000
3   1004   Mudit   80000

In [6]:
df#print in form of table

   empid empname  Salary
0   1001   Rohit   50000
1   1002   Mohit   60000
2   1003  Shobit  700000
3   1004   Mudit   80000

In [7]:
#shape is a proprty which display no of row and column 
df.shape

(4, 3)

In [8]:
#info() is a function in dataframe which is used to display information
df.info

<bound method DataFrame.info of    empid empname  Salary
0   1001   Rohit   50000
1   1002   Mohit   60000
2   1003  Shobit  700000
3   1004   Mudit   80000>

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   empid    4 non-null      int64
 1   empname  4 non-null      object
 2   Salary   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [10]:
#describe() used to give info about numberic column
df.describe()

             empid         Salary
count     4.000000       4.000000
mean   1002.500000  222500.000000
std       1.290994  318577.567739
min    1001.000000   50000.000000
25%    1001.750000   57500.000000
50%    1002.500000   70000.000000
75%    1003.250000  235000.000000
max    1004.000000  700000.000000

In [11]:
#head():used to display top rows (befault gives 5 rows)
df.head(2)

   empid empname  Salary
0   1001   Rohit   50000
1   1002   Mohit   60000

In [12]:
#tail:used to display bottom rows (bydefault 5)
df.tail(2)

   empid empname  Salary
2   1003  Shobit  700000
3   1004   Mudit   80000

In [13]:
#to_csv() function is used to write DataFrame data into .csv file
df.to_csv("emp.csv",index=None)
print("Infromation is saved")

Infromation is saved

In [14]:
#read_csv() function of pandas used to read csv file and return a data frame.
df2=pd.read_csv("emp.csv")
df2

   empid empname  Salary
0   1001   Rohit   50000
1   1002   Mohit   60000
2   1003  Shobit  700000
3   1004   Mudit   80000